app/services/ScheduleService.php

SELECT `subject`.`name` as `subject_name`, `teacher`.`name` as `teacher_name`, `class`.`nameClass`, `lichhoc`.`buoi`, `lichhoc`.`date`, `lichhoc`.`timeStar`, `lichhoc`.`timeEnd`
FROM `lichhoc`
JOIN `subject` ON `lichhoc`.`id_subject` = `subject`.`id`
JOIN `teacher` ON `lichhoc`.`id_teacher` = `teacher`.`id`
JOIN `class` ON `lichhoc`.`id_class` = `class`.`id`
---
    public function getSchedule()
    {
        return $this->schedule->table('lichhoc')
        ->select('subject.name as subject_name, teacher.name as teacher_name, class.nameClass,lichhoc.buoi,lichhoc.date,lichhoc.timeStar,lichhoc.timeEnd')
        ->join('subject', 'lichhoc.id_subject = subject.id')
        ->join('teacher', 'lichhoc.id_teacher = teacher.id')
        ->join('class', 'lichhoc.id_class = class.id')
        ->get()
        ->getResultArray();