app/services/StudentService.php

    public function getAllStudent()
    {
        return $this->students->table('student')
        ->select('student.masinhvien, student.name, class.nameClass, student.phone, student.ngaysinh, student.gioitinh, student.dantoc, student.diachi, student.quequan, student.hinhanh')
        ->join('student_class', 'student.id = student_class.student_id')
        ->join('class', 'student_class.class_id = class.id')->get()->getResultArray();
---
SELECT `student`.`id`, `student`.`masinhvien`, `student`.`name`, `class`.`nameClass`, `student`.`phone`, `student`.`ngaysinh`, `student`.`gioitinh`, `student`.`dantoc`, `student`.`diachi`, `student`.`quequan`, `student`.`hinhanh`
FROM `student`
JOIN `student_class` ON `student`.`id` = `student_class`.`student_id`
JOIN `class` ON `student_class`.`class_id` = `class`.`id`