app/services/TeacherService.php

SELECT *
FROM `teacher`
---
    public function getAllTeachers()
    {
        return $this->teachers->findAll();

UPDATE `teacher` SET `name` = 'Giáo sư Hoàng Túyd'
WHERE `teacher`.`id` IN ('2')
---
    public function updateTeacher($id, $field, $value)
    {
        // Sử dụng biến trung gian để tạo mảng kết hợp
        $data = [
            $field => $value
        ];

        // Cập nhật mảng kết hợp
        return $this->teachers->update($id, $data);

INSERT INTO `teacher` (`name`, `magiaovien`, `phone`, `trinhdo`, `hinhanh`) VALUES ('', '', '', '', '')
---
    public function addTeacher($data){
        try {
            if ($this->teachers->insert($data)) {

DELETE FROM `teacher`
WHERE `id` IN ('32')
---
    public function deleteTeacher($id){
        $deleted = $this->teachers->table('teachers')->delete(['id' => $id]);